#include <stdio.h>
//int main()//{//	double d = 1E10;//	printf("%lf\n", d);//	return 0;//}

//int main()
//{
//	float f = 5.5;
//	//5.5
//	//101.1
//	//(-1)^0*1.011*2^2
//	//S=0
//	//M=1.011
//	//E=2 +127=129
//	//0 10000001 011000000000000000000
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//0x40b00000 -十六进制
//	return 0;
//}


//int main()
//{
//	char a = 3;
//	//00000000 00000000 00000000 00000011
//	//00000011
//	char b = 127;
//	//00000000 00000000 00000000 01111111
//	//01111111
//
//	//a+b
//	//00000000 00000000 00000000 00000011
//	//00000000 00000000 00000000 01111111
//	//00000000 00000000 00000000 10000010
//	char c = a + b;
//	//10000010 -c
//	//高位是符号位
//	//11111111 11111111 11111111 10000010 -补码
//	//11111111 11111111 11111111 10000001 -反码
//	//10000000 00000000 00000000 01111110 -原码
//	//-126
//	printf("%d\n", c);
//	return 0;
//}


//int main()
//{
//	char a = 0xb6;
//	//十六进制b6
//	//二进制10110110
//	short b = 0xb600;
//	int c = 0xb6000000;
//
//	if (a == 0xb6)
//	//a要发生整形提升
//	//符号位为1
//	//提升后不相等
//		printf("a");
//	if (b == 0xb600)
//		printf("b");
//	if (c == 0xb6000000)
//		printf("c");
//	return 0;
//}


//int main()
//{
//	char c = 1;
//	printf("%u\n", sizeof(c));//1
//	printf("%u\n", sizeof(+c));//4
//	printf("%u\n", sizeof(!c));//1
//	return 0;
//}


//int main()
//{
//	printf("%d\n", sizeof(long double));//8
//	printf("%d\n", sizeof(double));//8
//	printf("%d\n", sizeof(float));//4
//	printf("%d\n", sizeof(unsigned long int));//4
//	printf("%d\n", sizeof(long int));//4
//	printf("%d\n", sizeof(unsigned int));//4
//	printf("%d\n", sizeof(int));//4
//	return 0;
//}

//int main()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	if (*p == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}




//int check_sys()
//{
//	int a = 1;
//	//char*p = (char*)&a;
//	////if (*p == 1)
//	////	return 1;
//	////else
//	////	return 0;
//
//	//return *p;
//	return *(char*)&a;
//}
//int main()
//{
//	int ret = check_sys();
//	if (ret == 1)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	return 0;
//}




//int main()
//{
//	char a = -1;
//	//10000000 00000000 00000000 00000001
//	//11111111 11111111 11111111 11111110
//	//11111111 11111111 11111111 11111111
//	//11111111
//	//-1的补码为全1
//	//char打印%d(int) 整形提升 按照这个数的原符号位提升
//	//高位为符号位
//	//11111111 11111111 11111111 11111111
//	signed char b = -1;
//	//11111111
//	//char默认有符号
//	//所以signed char打印结果和char相同
//	unsigned char c = -1;
//	//11111111
//	//无符号数整形提升 高位补0
//	//00000000 00000000 00000000 11111111
//	//255
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	//-1 -1 255
//	return 0;
//}


//int main()
//{
//	char a = -128;
//	//1000000 00000000 00000000 10000000
//	//1111111 11111111 11111111 01111111
//	//1111111 11111111 11111111 10000000 -补码
//	//10000000
//	//整形提升
//	//1111111 11111111 11111111 10000000 -补码
//	//应该将补码转换为原码
//	//但是无符号数的原反补相同 
//	//1111111 11111111 11111111 10000000 -原码
//	printf("%u\n", a);
//	//%d打印十进制的有符号数字
//	//%u打印十进制的无符号数字
//	//4294967168
//	return 0;
//}//int main()
//{
//	char a = 128;
//	//0000000 00000000 00000000 10000000
//	//0111111 11111111 11111111 01111111
//	//0111111 11111111 11111111 10000000 -补码
//	//10000000
//	//整形提升
//	//1111111 11111111 11111111 10000000 -补码
//	//应该将补码转换为原码
//	//但是无符号数的原反补相同 因为以%u形式进行打印 所以是无符号数
//	//1111111 11111111 11111111 10000000 -原码
//	printf("%u\n", a);
//	//%d打印十进制的有符号数字
//	//%u打印十进制的无符号数字
//	//4294967168
//	return 0;
//}//int main()//{//	int i = -20;
//	//10000000 00000000 00000000 00010100
//	//11111111 11111111 11111111 11101011
//	//11111111 11111111 11111111 11101100 -补码
//	unsigned int j = 10;
//	//00000000 00000000 00000000 00001010 -补码
//	printf("%d\n", i + j);
//	//11111111 11111111 11111111 11101100
//	//00000000 00000000 00000000 00001010
//	//11111111 11111111 11111111 11110110 -结果（补码）
//	//打印按照原码形式打印
//	//11111111 11111111 11111111 11110110 补码
//	//11111111 11111111 11111111 11110101 反码
//	//10000000 00000000 00000000 00001010 原码
//	//按照补码的形式进行运算，最后格式化成为有符号整数//	return 0;//}//int main()//{//	unsigned int i = 0;//	for (i = 9; i >= 0; i--)//	{//		printf("%u\n", i);//		Sleep(100);//	}//	return 0;//}//int main()
//{
//	char a[1000];//0-999
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;//-1,-2,...-1000
//		//-1,-2,...-128,127,126,...3,2,1,0,-1,-2，...
//		//-1-128 128个
//		//127-1 127个
//		//255个
//		//'\0'之前有255个
//	}
//	printf("%d", strlen(a));
//	return 0;
//}


//int main()
//{
//	unsigned char i = 0;
//	for (i = 0; i <= 255; i++)
//	//unsigned char范围0-255
//	//i<=255条件恒成立 所以死循环
//	{
//		printf("hello world\n");
//	}
//	return 0;
//}